-- MySQL dump 10.13  Distrib 8.0.30, for Win64 (x86_64)
--
-- Host: 127.0.0.1    Database: miniproject1
-- ------------------------------------------------------
-- Server version	8.0.30

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `comment`
--

DROP TABLE IF EXISTS `comment`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `comment` (
  `comNumber` int NOT NULL AUTO_INCREMENT,
  `number` int DEFAULT NULL,
  `writer` varchar(30) DEFAULT NULL,
  `comment` varchar(10000) DEFAULT NULL,
  `regDate` datetime DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`comNumber`)
) ENGINE=InnoDB AUTO_INCREMENT=111 DEFAULT CHARSET=utf8mb3;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `comment`
--

LOCK TABLES `comment` WRITE;
/*!40000 ALTER TABLE `comment` DISABLE KEYS */;
INSERT INTO `comment` VALUES (1,108,'parkbom','야이야~','2022-09-26 19:44:47'),(2,105,'parkbom','12321','2022-09-26 19:45:02'),(3,10,'20','asd','2022-09-26 20:15:09'),(4,411,'hwasuck1','빌보드고 나발이고 BTS 군대가라 나만가기 억울하다','2022-09-26 20:19:34'),(5,411,'jeahyunC','BTS는 군대 면제 해줘야지','2022-09-26 20:20:30'),(6,524,'hhk','오예~ 한명 재꼈고','2022-09-26 20:22:17'),(7,524,'경기도노인','ㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋ잘가라~ 멀리 안나간다','2022-09-26 20:23:29'),(8,524,'JavaKing','아~~~~~~~ Java로 programming 하고 싶다~~~ 어디 나랑 자바할사람없나??','2022-09-26 20:26:25'),(9,524,'goonmusae','힘내라.. 군대 다시가고.. ','2022-09-26 20:28:53'),(11,524,'테리짱짱짱','ㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋ','2022-09-26 20:31:04'),(13,72,'테리짱짱짱','아 너무 이쁘다 냥줍하고싶다','2022-09-26 20:35:13'),(14,70,'유누','너무 이뻐요~','2022-09-26 20:37:00'),(15,70,'KingSQLitSMe','do you know me?','2022-09-26 20:44:14'),(16,70,'PPAP','와.. 진짜 이쁘다 여신이야','2022-09-26 20:45:22'),(17,70,'오키도키요','저희 부대로 와주세요 제발요...','2022-09-26 20:47:03'),(18,70,'hw','별로안이쁜데 왜들 난리임? 내 여친이 더 이쁨','2022-09-26 20:48:17'),(19,71,'hw','윤아는 진짜 전설이다.. 이거 레알 실화냐? 가슴이 웅장해진다..','2022-09-26 20:49:39'),(20,71,'잘자요','ㅇㅈㅇㅈ.. ','2022-09-26 20:50:33'),(21,71,'래퍼Dong','내 여친임 건들지마셈 ㅡㅡ','2022-09-26 20:52:16'),(22,70,'나랑두사이다','가짜 사나이잖아 ..','2022-09-26 20:54:17'),(23,72,'디비디비딥','먀아아옹','2022-09-26 20:56:22'),(24,546,'유누','무플방지','2022-09-26 21:02:07'),(25,546,'유누','무플방지','2022-09-26 21:02:10'),(26,541,'유누','무플방지','2022-09-26 21:02:16'),(27,541,'유누','무플방지','2022-09-26 21:02:21'),(28,541,'유누','무플방지','2022-09-26 21:02:24'),(29,538,'유누','무플방지','2022-09-26 21:02:32'),(30,536,'유누','무플방지','2022-09-26 21:02:37'),(31,543,'유누','무플방지','2022-09-26 21:02:41'),(32,543,'유누','무플방지','2022-09-26 21:02:44'),(35,545,'apple0927','방탄은 군대 면제 받아야지','2022-09-26 21:03:34'),(36,506,'apple0927','헐 조심조심','2022-09-26 21:03:44'),(37,500,'apple0927','오바야진짜','2022-09-26 21:03:54'),(38,505,'apple0927','요즘도 저러네','2022-09-26 21:04:04'),(39,495,'apple0927','이거 진짜 재밌음 ㅋㅋㅋㅋㅋ','2022-09-26 21:04:25'),(40,534,'유누','무플방지','2022-09-26 21:05:13'),(41,530,'유누','무플방지','2022-09-26 21:05:26'),(42,1,'유누','이런ㅡㅡ','2022-09-26 21:05:37'),(43,11,'유누','무플방지','2022-09-26 21:05:47'),(44,11,'유누','무플방지','2022-09-26 21:05:51'),(45,79,'유누','무플방지','2022-09-26 21:05:59'),(46,79,'유누','무플방지','2022-09-26 21:06:01'),(47,79,'유누','무플방지','2022-09-26 21:06:03'),(48,79,'유누','무플방지','2022-09-26 21:06:05'),(49,79,'유누','무플방지','2022-09-26 21:06:08'),(50,75,'유누','무플방지','2022-09-26 21:06:13'),(51,7,'유누','무플방지','2022-09-26 21:06:19'),(52,91,'유누','무플방지','2022-09-26 21:06:24'),(53,96,'유누','무플방지','2022-09-26 21:06:28'),(54,96,'유누','무플방지','2022-09-26 21:06:30'),(55,533,'유누','무플방지','2022-09-26 21:06:41'),(56,547,'유누','무플방지','2022-09-26 21:07:01'),(57,547,'유누','무플방지','2022-09-26 21:07:03'),(58,547,'유누','무플방지','2022-09-26 21:07:05'),(59,547,'유누','무플방지','2022-09-26 21:07:08'),(60,547,'유누','무플방지','2022-09-26 21:07:13'),(61,523,'유누','무플방지','2022-09-26 21:07:20'),(62,523,'유누','무플방지','2022-09-26 21:07:22'),(63,523,'유누','무플방지','2022-09-26 21:07:25'),(64,519,'유누','무플방지','2022-09-26 21:07:30'),(65,519,'유누','무플방지','2022-09-26 21:07:32'),(66,516,'유누','무플방지','2022-09-26 21:07:37'),(67,518,'유누','무플방지','2022-09-26 21:07:43'),(68,512,'유누','무플방지','2022-09-26 21:07:49'),(69,512,'유누','무플방지','2022-09-26 21:07:51'),(70,514,'유누','무플방지','2022-09-26 21:08:00'),(71,514,'유누','무플방지','2022-09-26 21:08:04'),(72,510,'유누','무플방지','2022-09-26 21:08:11'),(73,510,'유누','무플방지','2022-09-26 21:08:13'),(75,5,'유누','무플방지','2022-09-26 21:08:22'),(76,6,'apple0927','존맛이지','2022-09-26 21:08:25'),(77,5,'유누','무플방지','2022-09-26 21:08:25'),(78,74,'유누','무플방지','2022-09-26 21:08:31'),(79,77,'apple0927','다른곳 가서 작성해라','2022-09-26 21:08:34'),(80,81,'유누','무플방지','2022-09-26 21:08:38'),(81,87,'유누','무플방지','2022-09-26 21:08:46'),(82,87,'유누','무플방지','2022-09-26 21:08:49'),(83,87,'유누','무플방지','2022-09-26 21:08:51'),(84,87,'유누','무플방지','2022-09-26 21:08:54'),(85,76,'유누','무플방지','2022-09-26 21:09:17'),(86,81,'유누','무플방지','2022-09-26 21:09:35'),(87,81,'유누','무플방지','2022-09-26 21:09:38'),(88,85,'유누','무플방지','2022-09-26 21:09:55'),(89,503,'유누','무플방지','2022-09-26 21:10:02'),(90,490,'유누','무플방지','2022-09-26 21:10:10'),(91,491,'유누','무플방지','2022-09-26 21:10:33'),(92,491,'유누','무플방지','2022-09-26 21:10:36'),(93,498,'유누','무플방지','2022-09-26 21:10:57'),(94,498,'유누','무플방지','2022-09-26 21:10:59'),(95,498,'유누','무플방지','2022-09-26 21:11:01'),(96,498,'유누','무플방지','2022-09-26 21:11:02'),(97,498,'유누','무플방지','2022-09-26 21:11:06'),(98,494,'유누','무플방지','2022-09-26 21:11:18'),(99,494,'유누','무플방지','2022-09-26 21:11:20'),(100,494,'유누','무플방지','2022-09-26 21:11:22'),(102,543,'유누','멍청이','2022-09-27 08:17:32'),(105,524,'유누','댓글을 작성해 보겠습니다.                                    ','2022-09-27 13:08:55'),(108,590,'유누','ㅎㅇㅎㅇ','2022-09-27 17:36:38'),(109,590,'유누','ㅎㅇㅎㅇ','2022-09-27 17:36:51');
/*!40000 ALTER TABLE `comment` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2022-09-28  6:15:43
